app/views/tracks/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user_id %><br>
    <%= f.collection_select(:user_id, User.all, :id, :name) %>

SELECT "albums".* FROM "albums"
---
    <%= f.label :album_id %><br>
    <%= f.collection_select(:album_id, Album.all, :id, :name) %>