app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("album_id", "created_at", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["album_id", 0], ["created_at", "2014-12-15 17:59:36.274422"], ["image", ""], ["name", "Acceptable in the 80's"], ["updated_at", "2014-12-15 17:59:36.274422"]]
---
  def create
    @track = Track.new(track_params)
    @track = current_user.tracks.new(track_params)
    @track.save

UPDATE "tracks" SET "album_id" = ?, "updated_at" = ? WHERE "tracks"."id" = 2  [["album_id", nil], ["updated_at", "2014-12-15 18:03:15.828556"]]
---
  def update
    @track.update(track_params)

DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 1]]
---
  def destroy
    @track.destroy

SELECT  "tracks".* FROM "tracks"  WHERE "tracks"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_track
      @track = Track.find(params[:id])